HMS/app/controllers/departments_controller.rb

  def index

    @departments = Department.all
---
SELECT * FROM `departments`

  def create

    @department = Department.new(params[:department])
    if @department.save
---
INSERT INTO `departments` (`created_at`, `name`, `updated_at`) VALUES('2018-04-25 09:56:22', 'Accident and emergency (A&E)', '2018-04-25 09:56:22')

  def destroy

    @department = Department.find(params[:id])
    if @department.destroy
---
SELECT * FROM `departments` WHERE (`departments`.`id` = 11)
DELETE FROM `departments` WHERE `id` = 11