HMS/app/controllers/doctors_controller.rb

  def new
    @current_user = User.find session[:user_id]
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def view_appointments
    @doctor=Doctor.find(params[:id])
    @appointments=@doctor.appointments.all(:order=>"appointment_date")
---
SELECT * FROM `appointments` WHERE (`appointments`.doctor_id = 12) ORDER BY appointment_date