HMS/app/controllers/patients_controller.rb

  def view_appointments
    @patient = Patient.find(params[:id])
    @appointments=@patient.appointments.all
---
SELECT * FROM `appointments` WHERE (`appointments`.patient_id = 2)

  def new_appointment
    @departments=Department.all
---
SELECT * FROM `departments`

  def list_available_doctors
    @appointment_date=params[:appoinment_date]
    dept_id=params[:department_id]
    appointment_date= params[:appointment_date]
    end_date= params[:appointment_date].to_time+params[:duration].to_i.minutes
    @department=Department.find(params[:department_id])
    @current_appointments=Appointment.all(:conditions=>["
      ((? BETWEEN appointment_date AND end_date )
                         OR (? BETWEEN appointment_date AND end_date )
                         OR(appointment_date<=? AND end_date>=?)
                          OR(?<appointment_date AND ? >end_date))",
        appointment_date,end_date,appointment_date,
        end_date,appointment_date,end_date])
---
SELECT * FROM `departments` WHERE (`departments`.`id` = 3)
SELECT * FROM `appointments` WHERE (

  def create_new_appointment
    @date=DateTime.new(params[:appointment]["appointment_date(1i)"].to_i,
      params[:appointment]["appointment_date(2i)"].to_i,
      params[:appointment]["appointment_date(3i)"].to_i,
      params[:appointment]["appointment_date(4i)"].to_i,
      params[:appointment]["appointment_date(5i)"].to_i)
    @patient = Patient.find(params[:id])
    @appointment=@patient.appointments.build(:doctor_id=>params[:appointment][:doctor_id],
      :appointment_date=>@date,:duration=>params[:appointment][:duration])
    if @appointment.save
---
INSERT INTO `appointments` (`updated_at`, `patient_id`, `end_date`, `created_at`, `appointment_date`, `doctor_id`, `duration`) VALUES('2018-05-02 04:22:28', 26, '2018-05-02 10:02:00', '2018-05-02 04:22:28', '2018-05-02 09:52:00', 24, 10)

  def delete_appointments
    @appo = Appointment.find(params[:id])
  	@appo.destroy
---
SELECT * FROM `appointments` WHERE (`appointments`.`id` = 5)
DELETE FROM `appointments` WHERE `id` = 5