HMS/app/controllers/users_controller.rb

  def home
    @current_user = User.find session[:user_id]
---
SELECT * FROM `users` WHERE (`users`.`id` = 2)