app/controllers/admins_controller.rb

  def index
    @current_user = User.find session[:user_id]
    @department = Department.all
    @doctor = Doctor.all
    @patient = Patient.all
    @room = Room.all
    @bed = Bed.all
    @registration = Registration.all
---
SELECT * FROM `users` WHERE ( (`users`.`type` = 'Doctor' ) )
SELECT * FROM `departments`
SELECT * FROM `rooms`
SELECT * FROM `beds`
SELECT * FROM `registrations`

  def view_bed
    @all_rooms=Room.all
    @rooms = @all_rooms.sort_by(&:room_no)
    @all_beds=Bed.all
---
SELECT * FROM `rooms`
SELECT * FROM `beds` WHERE (`beds`.room_id = 1)

  def create_new_room
    @room = Room.new(params[:room])
  	if @room.save
---
INSERT INTO `rooms` (`updated_at`, `room_no`, `created_at`) VALUES('2018-04-30 12:24:18', 'A&E-003', '2018-04-30 12:24:18')

  def delete_room
    @room = Room.find(params[:id])
  	@room.destroy
---
SELECT * FROM `rooms` WHERE (`rooms`.`id` = 2)
DELETE FROM `rooms` WHERE `id` = 2

  def new_bed
    @room = Room.find(params[:id])
---
SELECT * FROM `rooms` WHERE (`rooms`.`id` = 1)

  def create_new_bed
    @bed = Bed.new(params[:bed])
  	if @bed.save
---
INSERT INTO `beds` (`updated_at`, `bed_no`, `room_id`, `created_at`) VALUES('2018-04-30 12:24:29', 'A&E-00301', 5, '2018-04-30 12:24:29')

  def delete_bed
    @bed = Bed.find(params[:id])
    @bed.destroy
---
SELECT * FROM `beds` WHERE (`beds`.`id` = 1)
DELETE FROM `beds` WHERE `id` = 1

  def ajax_bed_view
    room_id=params[:room_id]
    start_time= params[:start_time]
    end_time= params[:end_time]
    patient_id = params[:patient_id]
    @registrations= Registration.all(:conditions => [ "((? BETWEEN start_time AND end_time )OR (? BETWEEN start_time AND end_time)
      OR(start_time<=? AND end_time>=?)OR(?<=start_time AND ? >=end_time))",
        start_time,end_time,start_time,end_time,start_time,end_time])
    @bed_ids = @registrations.collect(&:bed_id)
    @patients = @registrations.collect(&:patient_id)
    if @patients.present?
      @checkpatient = Registration.all(:conditions => ["patient_id in (?)",patient_id])
    end
    if @checkpatient.present?
      @beds = []
    else


      if @bed_ids.present?
        @beds=Bed.find(:all,:conditions=>["id NOT in (?) AND room_id in (?)",
            @bed_ids,room_id])
---
SELECT * FROM `registrations` WHERE ((('2018-4-26 06:36' BETWEEN start_time AND end_time )OR ('2018-4-26 06:36' BETWEEN start_time AND end_time)
SELECT * FROM `beds` WHERE (id NOT in (2) AND room_id in ('1'))

  def all_registration
    @registration=Registration.all
---
SELECT * FROM `registrations`

  def new_registration
    @registration=Registration.new
    @patients=Patient.all
    @rooms=Room.all
---
SELECT * FROM `rooms`

  def create_new_registration
    start_date=DateTime.new(params[:registration]["start_time(1i)"].to_i,
      params[:registration]["start_time(2i)"].to_i,
      params[:registration]["start_time(3i)"].to_i,
      params[:registration]["start_time(4i)"].to_i,
      params[:registration]["start_time(5i)"].to_i)
    end_date=DateTime.new(params[:registration]["end_time(1i)"].to_i,
      params[:registration]["end_time(2i)"].to_i,
      params[:registration]["end_time(3i)"].to_i,
      params[:registration]["end_time(4i)"].to_i,
      params[:registration]["end_time(5i)"].to_i)
    @registration=Registration.new(:patient_id=>params[:registration][:patient_id],
      :bed_id=>params[:registration][:bed_id],
      :start_time=>start_date,:end_time=>end_date)
    if @registration.save
---
INSERT INTO `registrations` (`start_time`, `bed_id`, `patient_id`, `created_at`, `updated_at`, `end_time`) VALUES('2018-04-30 11:09:00', 4, 13, '2018-04-30 05:40:24', '2018-04-30 05:40:24', '2018-05-03 11:09:00')

  def delete_registration
    @reg = Registration.find(params[:id])
  	@reg.destroy
---
SELECT * FROM `registrations` WHERE (`registrations`.`id` = 1)
DELETE FROM `registrations` WHERE `id` = 1